## 2장 10절 문자열 데이터 변환하기

### 1. 인덱싱

In [1]:
import pandas as pd

In [2]:
df_landmark = pd.DataFrame({'name':['광화문','호미곶', '첨성대'], 'location':['서울 종로구 사직로 161', 
                                                                     '경북 포항시 남구 호미곶면 대보리 150',
                                                                    '경북 경주시 인왕동 839-1']})
df_landmark

  name                location
0  광화문          서울 종로구 사직로 161
1  호미곶  경북 포항시 남구 호미곶면 대보리 150
2  첨성대        경북 경주시 인왕동 839-1

In [4]:
df_landmark['location'].str[3:6]

0    종로구
1    포항시
2    경주시
Name: location, dtype: object

### 2. 분할

In [5]:
df_landmark['location'].str.split(" ", expand=True)

    0    1    2      3     4     5
0  서울  종로구  사직로    161  None  None
1  경북  포항시   남구   호미곶면   대보리   150
2  경북  경주시  인왕동  839-1  None  None

In [14]:
df_landmark['loc_1'] = df_landmark['location'].str.split(" ").str[0]
df_landmark

  name                location loc_1
0  광화문          서울 종로구 사직로 161    서울
1  호미곶  경북 포항시 남구 호미곶면 대보리 150    경북
2  첨성대        경북 경주시 인왕동 839-1    경북

### 3. 탐색